pandas provides various facilities for easily combining together Series and DataFrame objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

Concat

Concatenating pandas objects together with concat():

In [2]:
import numpy as np
import pandas as pd

In [4]:
df=pd.DataFrame(np.random.randn(8,2))

In [5]:
df

          0         1
0  1.076407  0.669115
1 -1.109566  1.660215
2  0.822415 -1.059361
3  0.853932  0.122993
4  0.934336 -1.217335
5  0.127366 -0.740945
6  0.816058 -0.484756
7 -0.881466  0.257168

In [6]:
pieces=[df[:3],df[3:4],df[6:]]

In [8]:
pd.concat(pieces)

          0         1
0  1.076407  0.669115
1 -1.109566  1.660215
2  0.822415 -1.059361
3  0.853932  0.122993
6  0.816058 -0.484756
7 -0.881466  0.257168

In [9]:
#Join
#SQL style merges:
left=pd.DataFrame({'key': ['s1', 's1'], 'lval': [1, 2]})

In [10]:
left

  key  lval
0  s1     1
1  s1     2

In [11]:
right = pd.DataFrame({'key': ['s1', 's1'], 'rval': [3, 4]})
right

  key  rval
0  s1     3
1  s1     4

In [12]:
pd.merge(left,right,on='key')

  key  lval  rval
0  s1     1     3
1  s1     1     4
2  s1     2     3
3  s1     2     4

In [13]:
left = pd.DataFrame({'key': ['s1', 's2'], 'lval': [2, 3]})
left

  key  lval
0  s1     2
1  s2     3

In [14]:
right = pd.DataFrame({'key': ['s1', 's2'], 'rval': [4, 5]})
right

  key  rval
0  s1     4
1  s2     5

In [15]:
pd.merge(left, right, on='key')

  key  lval  rval
0  s1     2     4
1  s2     3     5

In [16]:
#Append rows to a DataFrame
df = pd.DataFrame(np.random.randn(4, 4), columns=['P', 'Q', 'R', 'S'])
df

          P         Q         R         S
0 -0.303352  1.384887 -0.338843 -1.301389
1  1.017194 -0.067096  0.442695  0.149709
2  2.071555  0.685679 -0.434146 -1.454721
3  1.038105 -1.163690  1.411471  0.084737

In [17]:
s=df.iloc[3]

In [18]:
df.append(s, ignore_index=True)

C:\Users\panka\AppData\Local\Temp\ipykernel_616\4011806271.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(s, ignore_index=True)

          P         Q         R         S
0 -0.303352  1.384887 -0.338843 -1.301389
1  1.017194 -0.067096  0.442695  0.149709
2  2.071555  0.685679 -0.434146 -1.454721
3  1.038105 -1.163690  1.411471  0.084737
4  1.038105 -1.163690  1.411471  0.084737